Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_welfare_appeals.html.txt.tmx
Source language: en
Languages: ga

source: You must appeal within 21 days of the notification of the decision on your claim
ga: Oifig Achomharc Leasa Shóisialaigh

source: The Social Welfare Appeals Office (SWAO) operates independently of the Department of Social Protection
ga: Más dóigh leat gur diúltaíodh sochar leasa shóisialaigh go héagórach duit, tá sé de rogha agat achomharc a dhéanamh in aghaidh an chinnidh seo chuig an Oifig Achomharc Leasa Shóisialaigh

source: It aims to provide an independent, accessible and fair appeals service with regard to entitlement to social welfare payments and to deliver that service in a prompt and courteous manner
ga: Mura bhfuil tú sásta le cinneadh a rinne Oifigeach Cinnidh Leasa Shóisialaigh, is féidir leat achomharc a dhéanamh freisin. Oifig neamhspleách reachtúil í an Oifig Achomharc Leasa Shóisialaigh

source: The Office is headed by a Chief Appeals Officer and has its own Appeals Officers who make decisions on appeals
ga: Ciallaíonn sé go bhfeidhmíonn an Oifig Achomharc go neamhspleách ar an Roinn Coimirce Sóisialaí

source: You can get a list of social welfare schemes and benefits covered by the Social Welfare Appeals Office (pdf)
ga: Áfach ní bhíonn an Oifig ag déileáil leis na gnéithe lánroghnach den scéim

source: The Social Welfare Appeals Office also deals with appeals for some payments under the Supplementary Welfare Allowance Scheme
ga: Tá liosta scéimeanna agus sochair leasa shóisialaigh faoi chumdach na hOifige Achomharc Leasa Shóisialaigh ar fáil

source: If you have been refused a social welfare payment or you disagree with a decision of a Deciding Officer or Designated Person you must appeal within 21 days of the decision
ga: Is féidir leat achomharc a dhéanamh laistigh de 21 lá chuig an Oifig Achomharc Leasa Shóisialaigh

source: In exceptional cases, appeals received outside of this period may be accepted. You must set out in your appeal why you think the decision was not correct and include any evidence and documents you want to be considered by the Social Welfare Appeals Office
ga: Más dóigh leat gur diúltaíodh sochar leasa shóisialaigh go héagórach duit in Éirinn, nó mura bhfuil tú sásta le cinneadh a rinne Oifigeach Cinnidh Leasa Shóisialaigh, ba chóir duit achomharc a dhéanamh

source: You can request an oral hearing at this stage
ga: laistigh de 21 lá ó rinneadh an cinneadh

source: If you are still not happy with the decision following the Department’s clarification you can appeal the decision to the SWAO.│
ga: Glacfar le hachomhairc i ndiaidh na tréimhse seo i gcásanna eisceachtúla

source: Once an appeal has been lodged the Social Welfare Appeals Office (SWAO) notifies the Department of Social Protection of the appeal
ga: Seolfar admháil chugat nuair a fhaigheann an Oifig Achomharc an achomharc a rinne tú

source: When the Department of Social Protection receives notice of an appeal it reviews the original decision to decide whether it should be revised in your favour
ga: ar dtús, caithfidh an Oifig Achomhairc cur do chás ar aghaidh go dtí an Roinn Coimirce Sóisialaí lena dtuairimí a fháil

source: In some cases, this means that new evidence is reviewed by a medical assessor or a social welfare inspector
ga: D'fhéadfadh an Roinn athbhreithniú ar a cinneadh ag an bpointe seo de thoradh na fianaise nua a chuireadh os a comhair

source: If the decision is changed by the Department at this stage you will be informed
ga: Má bheartaíonn siad gan aon athrú a dhéanamh, áfach, déanfaidh Oifigeach Achomhairc do chás a mheas

source: If the decision is not changed by the Department, your case will be examined by an Appeals Officer
ga: D'fhéadfadh an Oifigeach Achomhairc cinneadh a dhéanamh ar d'achomharc bunaithe ar fhianaise i scríbhinn

source: Your appeal may be heard at an oral hearing—either because you have requested one or because the Appeals Officer decided that this is appropriate for your appeal
ga: I gcásanna eile d'fheadfadh an tOifigeach Achomhairc cuireadh a thabhairt duit teacht chun agallaimh agus do chás a phlé

source: You will be invited to attend this hearing
ga: Agallamh neamhfhoirmiúil é seo

source: It is informal and you can bring a representative to the hearing with you for support or assistance
ga: D'fhéadfá cara, comhghleacaí, ionadaí poiblí nó oifigeach ceardchumainn a bheith agat mar ionadaí

source: A representative may include a friend, colleague, public representative or trade union official
ga: Tá sé de chead agat ionadaí dlí a thabhairt leat más mian leat é - ach ní gá é seo

source: Hearings are held in private
ga: Bíonn na héisteachtaí seo príobháideach

source: Generally, the decision of an Appeals Officer is final
ga: De ghnáth níl aon dul thar cinneadh Oifigeach na nAchomharc

source: However, an Appeals Officer may revise their decision if new evidence, new facts or any relevant change of circumstances come to light after a decision is made
ga: Féadfaidh Oifigeach na nAchomharc athbhreithniú ar a c(h)inneadh má thagann fianaise nua, fíricí nua nó athrú ábharach ar chúinsí chun solais tar éis dó/di cinneadh a dhéanamh

source: If you don't agree with the Appeals Officer's decision
ga: Mura n-aontaíonn le cinneadh a rinne Oifigeach Breithiúnachta

source: The Chief Appeals Officer may revise a decision of an Appeals Officer if it appears that a mistake was made in relation to the law or the facts
ga: D'fhéadfadh Príomh-Oifigeach na nAchomharc athbhreithniú ar chinneadh Oifigigh na nAchomharc má dhealraíonn sé gur rinneadh botún i leith an dlí nó i leith na bhfíricí

source: In either case you should send a written request for a revised decision and enclose the new evidence
ga: Ar aon chaoi ba chóir duit iarratas i scríbhinn a sheoladh chun athbhreithniú ar chinneadh a fháil

source: It is important to state the grounds on which you are seeking a revised decision
ga: Tá sé tábhachtach na cúiseanna a chur in iúl atá leis an athbhreithniú ar chinneadh atá tú ag lorg

source: If you are seeking a review by the Chief Appeals Officer, you must give specific reasons why you believe a mistake has been made regarding the law or the facts
ga: Mura n-aontaíonn tú le cinneadh deiridh na hOifige Achomhairc, is féidir leat iarratas chuig na hOifige an Ombudsman chun do chás a scrúdú

source: If you disagree with the final decision of the Social Welfare Appeals Office you can request the Office of the Ombudsman to examine your case
ga: Tá an ceart ag an Ombudsman an cothroime in aon cinneadh déanta ag an Oifig Achomhairc a breathnú

source: You may appeal to the High Court on a point of law or seek a judicial review in the High Court if you think that the appeal was not fairly conducted
ga: Féadfaidh tú achomharc a dhéanamh chun nahArd-Chúirte faoi phointe dlí nó athbhreithniú dlíthiúil a iarradh san Ard-Chúirt má mheasann tú nár caitheadh go cothrom le d'achomharc

source: You should however get legal advice in this situation
ga: (Sa chás sin ba chóir duit comhairle dlí a fháil)

source: Non-statutory social welfare schemes
ga: Scéimeanna neamhreachtúla leasa shóisialaigh

source: The Social Welfare Appeals Office does not deal with schemes that are not on a statutory basis - for example, the Household Benefits Scheme or the Free Travel Scheme
ga: Ní dhéileálann an Oifig Achomharc Leasa Shóisialaigh le scéimeanna nach bhfuil bunús reachtúil acu - mar shampla, na scéimeanna saora agus na scéimeanna le filleadh ar obair

source: There is no formal appeals system for these schemes. However, if you are not satisfied, you should ask for the decision to be reviewed by the section in the Department of Social Protection that dealt with your application
ga: Níl aon chóras foirmeálta ann le hachomharc a dhéanamh i gcás na scéimeanna seo, ach mura bhfuil tú sásta ba chóir duit a iarradh go ndéanfaidh rannóg an Roinn Coimirce Sóisialaí, a dhéileáil le d'iarratas, athbhreithniú an cinneadh

source: The Social Welfare Tribunal is a special statutory appeals system for people who are refused Jobseeker's Benefit or Jobseeker's Allowance because of an industrial dispute at their place of employment
ga: Is an Bínse Leasa Shóisialaigh é córas reachtúil achomhairc do dhuine a dhiúltaítear Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist le haghaidh aighneas tionsclaíoch ar siúl ina (h)ionad oibre

source: It provides a second level of appeal after an appeal to the Social Welfare Appeals Office
ga: Is an Binse é dara leibhéal achomhairc tar éis achomharc chuig an Oifig Achomharc Leasa Shóisialaigh

source: However, you can also appeal directly to the Tribunal without first going through the Social Welfare Appeals Office
ga: Áfach, is féidir achomarc a dhéanamh díreach chuig an Binse, gan an chéad achomharc chuig Oifig Achomharc Leasa Shóisialaigh

source: There is no fee for making an appeal about a social welfare decision to the Social Welfare Appeals Office
ga: Níl aon táille i gceist chun achomharc a dhéanamh faoi chinneadh leasa shóisialaigh chuig Oifig Achomharc Leasa Shóisialaigh

source: If you have to travel to attend a hearing, the Social Welfare Appeals Office will compensate you for any reasonable travel expenses
ga: Má bhíonn ort taisteal le bheith i láthair ag éisteacht, déanfaidh an Oifig Achomharc cúiteamh a thabhairt duit ar aon chostas réasúnta taistil

source: You can also be compensated for any loss of earnings if you have to take time off work to attend
ga: Is féidir aon chaillteanas íocaíochta a chúiteamh leat freisin, má bhíonn ort fanacht amach ó obair le bheith i láthair

source: The Social Welfare Appeals Office may make an award to a representative such as a solicitor if they accompany you to the appeal
ga: Féadfaidh an Oifig Achomharc dámhachtain a dhéanamh le hionadaí, dlíodóir mar shampla, a rachadh leat chun na héisteachta

source: You make your application on the special Social Welfare Appeals form (pdf), also available from your Intreo centre or social welfare local office or the Social Welfare Appeals Office
ga: Déan d'iarratas ar an fhoirm achomhairc leasa shóisialaigh speisialta (pdf) atá le fáil ó d'oifig leasa shóisialaigh áitiúil, nó féadfaidh tú na cúiseanna atá agat achomharc a dheanamh a scríobh i litir agus í a sheoladh chuig an Oifig Achomharc

source: Alternatively, you may set out the grounds of your appeal in a letter to the Appeals Office or by email to swappeals@welfare.ie
ga: Caithfidh tú an fhaisnéis seo a leanas a sholáthair i d'achomharc:

source: • Your Personal Public Service Number
ga: • Do Uimhir Phearsanta Seirbhíse Poiblí

source: • The payment you are claiming • The decision you are appealing against
ga: • An cineál íocaíochta a bhfuil á héileamh agat

source: • The reasons you disagree with the decision
ga: • An cinneadh a bhfuil achomharc á dhéanamh agat ina aghaidh

source: In some cases, the Appeals Officer decides to hold an oral hearing
ga: • Na fáthanna nach n-aontaíonn tú leis an gcinneadh a rinneadh

source: Further information is available in Social Welfare Appeals Office - An Introduction (pdf)
ga: Is féidir breis eolais a fháil faoi Oifig na nAchomharc Leasa Shóisialaigh in Oifig na nAchomharc - Treoir Gearr Tosaigh

source: Information and advice is also available from your Intreo centre, local social welfare office or from the Social Welfare Appeals Office
ga: Is féidir faisnéis agus comhairle a fháil ón d’oifig leasa shóisialaigh áitiúil freisin, nó go díreach ón Oifig Achomharc féin
